In [1]:
import pandas as pd
data = pd.read_csv(r"C:\Users\girim\Downloads\NewspaperData.csv")
data.head()

            Newspaper    daily   sunday
0       Baltimore Sun  391.952  488.506
1        Boston Globe  516.981  798.298
2       Boston Herald  355.628  235.084
3  Charlotte Observer  238.555  299.451
4   Chicago Sun Times  537.780  559.093

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Newspaper  34 non-null     object
 1   daily      34 non-null     float64
 2   sunday     34 non-null     float64
dtypes: float64(2), object(1)
memory usage: 948.0+ bytes

In [7]:
data.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
dtype: bool

In [9]:
data.shape

(34, 3)

In [11]:
data.tail()

                  Newspaper    daily    sunday
29  San Francisco Chronicle  570.364   704.322
30  St. Louis Post-Dispatch  391.286   585.681
31   St. Paul Pioneer Press  201.860   267.781
32            Tampa Tribune  321.626   408.343
33          Washington Post  838.902  1165.567

In [15]:
data.isnull().sum()

Newspaper    0
daily        0
sunday       0
dtype: int64

In [17]:
data.sample(10)

                 Newspaper     daily    sunday
19                 Newsday   825.512   960.308
1             Boston Globe   516.981   798.298
18          New York Times  1209.225  1762.015
7              Denver Post   252.624   417.779
21  Orange County Register   354.843   407.760
0            Baltimore Sun   391.952   488.506
22   Philadelphia Inquirer   515.523   982.663
2            Boston Herald   355.628   235.084
5          Chicago Tribune   733.775  1133.249
9         Hartford Courant   231.177   323.084

Correlation:

In [26]:
data.drop('Newspaper',axis=1).corr()

           daily    sunday
daily   1.000000  0.958154
sunday  0.958154  1.000000

In [28]:
import warnings
warnings.filterwarnings('ignore')

In [ ]:
import pandas as pd
d=pd.read_csv(r)